InformationRegisters/ОтветственныеЗаДефекты.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.ОтветственныеЗаДефекты" category="Record">				<xr:TypeId>cc64bfe2-ebce-4428-8c74-19e7df235468</xr:TypeId>				<xr:ValueId>a56376d2-013f-4937-9dc7-025cf4a0f041</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.ОтветственныеЗаДефекты" category="Manager">				<xr:TypeId>48092f7a-9cee-416d-ab6a-c9f451c4f49d</xr:TypeId>				<xr:ValueId>b08005d8-dad4-4531-a3dc-595c922bd157</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.ОтветственныеЗаДефекты" category="Selection">				<xr:TypeId>9d5f0059-4c01-4542-9d35-9925174a4950</xr:TypeId>				<xr:ValueId>e177865e-9661-47d7-9e7e-7694eee612fd</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.ОтветственныеЗаДефекты" category="List">				<xr:TypeId>792a3553-6469-4a98-88bb-b0c1c91b6405</xr:TypeId>				<xr:ValueId>960bcd8d-e35f-404c-81f3-8c7b0a0900e0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.ОтветственныеЗаДефекты" category="RecordSet">				<xr:TypeId>e75de5e5-df94-468e-8cbc-a71f0565c376</xr:TypeId>				<xr:ValueId>b1c4163e-b85a-41b7-92c1-30ca49446dbe</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.ОтветственныеЗаДефекты" category="RecordKey">				<xr:TypeId>b1efe448-9e5d-42dd-86e9-b652e18f7d49</xr:TypeId>				<xr:ValueId>36bc4e97-b43c-4abe-802c-45d5546ba3d0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.ОтветственныеЗаДефекты" category="RecordManager">				<xr:TypeId>ca2e11aa-80f5-4fb2-8ea6-cbb6c7063e69</xr:TypeId>				<xr:ValueId>99d008bf-f0ac-4fa3-807c-905de6a78e02</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ОтветственныеЗаДефекты</Name>			<Synonym>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Responsible for defects</v8:content>				</v8:item>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Альтернативные ответственные за дефекты</v8:content>				</v8:item>			</Synonym>			<Comment>В случае, если нас не устраивает отвественный в ИЭ, то мы устанавливаем Ответственного</Comment>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Ответственный</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Ответственный</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Responsible</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ОтветственныйЗаДефект</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>ТочкаПроверкиКачества</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Точка проверки качества</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Check of quanlity point</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиПроверкиКачества</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>true</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>true</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ИнспектируемыйЭлемент</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Инспектируемый элемент</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Inspected element</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ИнспектируемыеЭлементы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>true</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>true</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Дефект</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Дефект</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Дефекты</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ТипДефекта</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Тип дефекта</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТипыДефектов</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

InformationRegisters/ОтветственныеЗаДефекты/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Получает из регистра и возвращает ответственного за дефект.
//
// Параметры:
//  ТочкаПроверкиКачества - СправочникСсылка.ТочкиПроверкиКачества - точка проверки качества.
//  ИнспектируемыйЭлемент - СправочникСсылка.ИнспектируемыеЭлементы - инспектируемый элемент.
//  Дефект - СправочникСсылка.Дефекты - дефект.
//  ТипДефекта - СправочникСсылка.ТипыДефектов - тип дефекта.
//
// Возвращаемое значение:
//  СправочникСсылка.ОтветственныйЗаДефект
//
Функция ПолучитьОтветственногоЗаДефект(ТочкаПроверкиКачества, ИнспектируемыйЭлемент, Дефект, ТипДефекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ИнспектируемыйЭлемент", ИнспектируемыйЭлемент);
	Запрос.УстановитьПараметр("ТочкаПроверкиКачества", ТочкаПроверкиКачества);
	Запрос.УстановитьПараметр("Дефект", Дефект);
	Запрос.УстановитьПараметр("ТипДефекта", ТипДефекта);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЗаДефектыСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаДефекты.СрезПоследних(
		|			&Период,
		|			ТочкаПроверкиКачества = &ТочкаПроверкиКачества
		|				И ИнспектируемыйЭлемент = &ИнспектируемыйЭлемент
		|				И Дефект = &Дефект
		|				И ТипДефекта = &ТипДефекта) КАК ОтветственныеЗаДефектыСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Ответственный = Выборка.Ответственный;
	Иначе
		Ответственный = Справочники.ОтветственныйЗаДефект.ПустаяСсылка();
	КонецЕсли;
	
	
	Возврат Ответственный;
	
КонецФункции

#КонецОбласти
